Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2025DAH176.atdf
         <interrupt caption="ADC7 Early Interrupt Request" index="206" module-instance="ADC7_EARLY" name="ADC7_EARLY" />
         <interrupt caption="ADC0 Warm Interrupt Request" index="207" module-instance="ADC0_WARM" name="ADC0_WARM" />
         <interrupt caption="ADC1 Warm Interrupt Request" index="208" module-instance="ADC1_WARM" name="ADC1_WARM" />
         <interrupt caption="ADC2 Warm Interrupt Request" index="209" module-instance="ADC2_WARM" name="ADC2_WARM" />
         <interrupt caption="ADC3 Warm Interrupt Request" index="210" module-instance="ADC3_WARM" name="ADC3_WARM" />
         <interrupt caption="ADC4 Warm Interrupt Request" index="211" module-instance="ADC4_WARM" name="ADC4_WARM" />
         <interrupt caption="ADC7 Warm Interrupt Request" index="214" module-instance="ADC7_WARM" name="ADC7_WARM" />
         <interrupt caption="MPLL Fault" index="215" name="MPLL_FAULT" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 4" name="DEVCFG4" initval="0xF4FFFFFF">
            <bitfield caption="Sleep Mode Watchdog Timer Postscale Select bits" mask="0x1f000000" name="SWDTPS" values="DEVCFG4__SWDTPS" />
         </register>
         <register caption="Device Configuration Word 3" name="DEVCFG3" initval="0xFFFFFFFF">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />            <bitfield caption="Ethernet MII Enable Configuration bit" mask="0x1000000" name="FMIIEN" values="DEVCFG3__FMIIEN" />
            <bitfield caption="Ethernet I/O Pin Selection Configuration bit" mask="0x2000000" name="FETHIO" values="DEVCFG3__FETHIO" />
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
         </register>
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xF7F9B198">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG" />
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK" />
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT" />
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
            <bitfield caption="VBAT BOR Enable bit" mask="0x80000" name="VBATBOREN" values="DEVCFG2__VBATBOREN" />
            <bitfield caption="Deep Sleep BOR Enable bit" mask="0x100000" name="DSBOREN" values="DEVCFG2__DSBOREN" />
            <bitfield caption="Deep Sleep Watchdog Timer Postscale Select bits" mask="0x3e00000" name="DSWDTPS" values="DEVCFG2__DSWDTPS" />
            <bitfield caption="Deep Sleep Watchdog Timer Reference Clock Select bit" mask="0x4000000" name="DSWDTOSC" values="DEVCFG2__DSWDTOSC" />
            <bitfield caption="Deep Sleep Watchdog Timer Enable bit" mask="0x8000000" name="DSWDTEN" values="DEVCFG2__DSWDTEN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x10000000" name="FDSEN" values="DEVCFG2__FDSEN" />
            <bitfield caption="USB PLL Input Frequency Select bit" mask="0x40000000" name="UPLLFSEL" values="DEVCFG2__UPLLFSEL" />
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FCF9">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT" />
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000L" name="FDMTEN" values="DEVCFG1__FDMTEN" />
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x77FFF7D3">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN" />
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA" />
            <bitfield caption="Dynamic Flash ECC Configuration bits" mask="0x300" name="FECCCON" values="DEVCFG0__FECCCON" />
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP" />
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN" />
            <bitfield caption="Secondary Oscillator Kick Start Programmability bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Course Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN" />
            <bitfield caption="Primary Oscillator Boost bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Fine Gain Control bits" mask="0xc00000" name="POSCFGAIN" values="DEVCFG0__POSCFGAIN" />
            <bitfield caption="Primary Crystal AGC Gain Search Step Settling Time Control bits" mask="0x3000000" name="POSCAGCDLY" values="DEVCFG0__POSCAGCDLY" />
            <bitfield caption="Primary Oscillator Automatic Gain Control bit" mask="0x8000000" name="POSCAGC" values="DEVCFG0__POSCAGC" />
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN" />
         </register>
         <register caption="BOOT FLASH 1 SEQUENCE WORD 0 REGISTER" name="BF1SEQ3" initval="0xFFFF0000">
            <bitfield caption="Boot Flash True Sequence Number bits" mask="0xffff" name="TSEQ" values="BF1SEQ3__TSEQ" />
            <bitfield caption="Boot Flash Complement Sequence Number bits" mask="0xffff0000L" name="CSEQ" values="BF1SEQ3__CSEQ" />
         </register>
      </register-group>
      <value-group caption="Sleep Mode Watchdog Timer Postscale Select bits" name="DEVCFG4__SWDTPS">
         <value caption="1:1" name="SPS1" value="0x0" />
         <value caption="1:2" name="SPS2" value="0x1" />
         <value caption="1:4" name="SPS4" value="0x2" />
         <value caption="1:8" name="SPS8" value="0x3" />
         <value caption="1:16" name="SPS16" value="0x4" />
         <value caption="1:32" name="SPS32" value="0x5" />
         <value caption="1:64" name="SPS64" value="0x6" />
         <value caption="1:128" name="SPS128" value="0x7" />
         <value caption="1:256" name="SPS256" value="0x8" />
         <value caption="1:512" name="SPS512" value="0x9" />
         <value caption="1:1024" name="SPS1024" value="0xa" />
         <value caption="1:2048" name="SPS2048" value="0xb" />
         <value caption="1:4096" name="SPS4096" value="0xc" />
         <value caption="1:8192" name="SPS8192" value="0xd" />
         <value caption="1:16384" name="SPS16384" value="0xe" />
         <value caption="1:32768" name="SPS32768" value="0xf" />
         <value caption="1:65536" name="SPS65536" value="0x10" />
         <value caption="1:131072" name="SPS131072" value="0x11" />
         <value caption="1:262144" name="SPS262144" value="0x12" />
         <value caption="1:524288" name="SPS524288" value="0x13" />
         <value caption="1:1048576" name="SPS1048576" value="0x14" />
      </value-group>
      <value-group caption="UserID" name="" />
      <value-group caption="Ethernet MII Enable Configuration bit" name="DEVCFG3__FMIIEN">
         <value caption="RMII Enabled" name="OFF" value="0x0" />
         <value caption="MII Enabled" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Ethernet I/O Pin Selection Configuration bit" name="DEVCFG3__FETHIO">
         <value caption="Alternate Ethernet I/O" name="OFF" value="0x0" />
         <value caption="Default Ethernet I/O" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Permission Group Lock One Way Configuration bit" name="DEVCFG3__PGL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="7x Divider" name="DIV_7" value="0x6" />
         <value caption="8x Divider" name="DIV_8" value="0x7" />
      </value-group>
      <value-group caption="System PLL Divided Input Clock Frequency Range bits" name="DEVCFG2__FPLLRNG">
         <value caption="Bypass" name="RANGE_BYPASS" value="0x0" />
         <value caption="5-10 MHz Input" name="RANGE_5_10_MHZ" value="0x1" />
         <value caption="8-16 MHz Input" name="RANGE_8_16_MHZ" value="0x2" />
         <value caption="13-26 MHz Input" name="RANGE_13_26_MHZ" value="0x3" />
         <value caption="21-42 MHz Input" name="RANGE_21_42_MHZ" value="0x4" />
         <value caption="34-68 MHz Input" name="RANGE_34_68_MHZ" value="0x5" />
      </value-group>
